# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'  if OS.mac?

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'fasd'
brew 'ffmpeg'
brew 'gh' if OS.mac?
brew 'git'
brew 'grep'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'neovim'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'starship'
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim' if OS.mac?
brew 'optipng' if OS.mac?
brew 'pngquant' if OS.mac?
brew 'svgo' if OS.mac?
brew 'gifsicle' if OS.mac?

# Development
brew 'imagemagick'
brew 'yarn'

# Apps
cask 'discord' if OS.mac?
cask 'docker' if OS.mac?
cask 'firefox' if OS.mac?
#cask 'github' if OS.mac?
cask 'google-chrome' if OS.mac?
cask 'imageoptim' if OS.mac?
cask 'pastebot' if OS.mac?
cask 'ray' if OS.mac?
cask 'raycast' if OS.mac?
cask 'screenflow' if OS.mac?
cask 'slack' if OS.mac?
cask 'the-unarchiver' if OS.mac?
#cask 'tunnelbear' if OS.mac?
#cask 'tuple' if OS.mac?
cask 'visual-studio-code' if OS.mac?
cask 'zoom' if OS.mac?

# Quicklook
cask 'qlmarkdown' if OS.mac?
cask 'quicklook-json' if OS.mac?

# Fonts
cask 'font-lato' if OS.mac?
cask 'font-open-sans' if OS.mac?
cask 'font-roboto' if OS.mac?
cask 'font-source-code-pro-for-powerline' if OS.mac?
cask 'font-source-code-pro' if OS.mac?
cask 'font-source-sans-pro' if OS.mac?
cask 'font-source-serif-pro' if OS.mac?

# Mac App Store
#mas 'Byword', id: 420212497 if OS.mac?
#mas 'Giphy Capture', id: 668208984
#mas 'Keynote', id: 409183694
#mas 'Numbers', id: 409203825
#mas 'Speedtest', id: 1153157709
#mas 'Spring', id: 1508706541
#mas 'Things', id: 904280696
